{
  "sections": [
    {
      "name": "Техническое задание",
      "children": [
        {
          "name": "Общая информация",
          "children": [
            {
              "text": "Конфигурация «Бухгалтерия предприятия» в среде «1С: Предприятие 8.1»",
              "name": "Полное наименование системы и ее условное обозначение"
            },
            {
              "text": "ДП – УлГТУ –  08080165 – 00/00000 – 2010",
              "name": "Шифр темы или шифр (номер) договора"
            },
            {
              "text": "УМКУП «Городской градостроительный сервис», .Ульяновск, пер.Комсомольский 3, 8-962-633-01-77",
              "name": "Наименование предприятий (объединений) разработчика и заказчика (пользователя) системы и их реквизиты"
            },
            {
              "text": "",
              "name": "Перечень документов, на основании которых создается система, кем и когда утверждены эти документы"
            },
            {
              "text": "1 апреля . – 15 июня .",
              "name": "Плановые сроки начала и окончания работы по созданию системы"
            },
            {
              "text": "работа проводится на безвозмездной основе, не финансируется",
              "name": "Сведения об источниках и порядке финансирования работ"
            },
            {
              "text": "полное наименование системы и ее условное обозначение: Конфигурация «Бухгалтерия предприятия» в среде «1С: Предприятие 8.1»\nшифр темы: ДП – УлГТУ –  08080165 – 00/00000 – 2010\nнаименование предприятий разработчика и заказчика системы, их реквизиты: УМКУП «Городской градостроительный сервис», .Ульяновск, пер.Комсомольский 3, 8-962-633-01-77\nперечень документов, на основании которых создается информационная система:\nплановые сроки начала и окончания работ:1 апреля . – 15 июня .\nсведения об источниках и порядке финансирования работ: работа проводится на безвозмездной основе, не финансируется\nпорядок оформления и предъявления заказчику результатов работ по созданию системы, ее частей и отдельных средств: по окончанию работ заказчику передается установочный диск со всеми дистрибутивами, необходимыми для функционирования разработанного программного продукта, а так же сопроводительная документация: техническое задание и методические указания пользователю и программисту.\n",
              "name": "Общие сведения"
            }
          ]
        },
        {
          "name": "Назначение и цели создания (развития) системы",
          "children": [
            {
              "text": "",
              "name": "Назначение системы"
            },
            {
              "text": "Разработанный программный продукт предназначен для обеспечения полноты автоматизации деятельности бухгалтера организации УМКУП «Городской градостроительный сервис» при использовании конфигурации «Бухгалтерия предприятия» на платформе «1С: Предприятие 8.1» в части расчета заработной платы  и учета деятельности сотрудников организации. Предполагается использование системы на автоматизированном рабочем месте главного бухгалтера организации.\nОсновными целями создания системы являются:\nдополнение существующей информационной системы, которая не предоставляет возможность расчета заработной платы организации, имеющей специфические принципы оплаты труда соответствующим функционалом, который, кроме того, затрагивает автоматизацию процессов, влияющих на процесс формирования сумм заработной платы\nповышение эффективности исполнения автоматизируемых процессов, путем сокращения непроизводительных и дублирующих операций, операций, выполняемых «вручную», оптимизации информационного взаимодействие участников процессов\nповышение качества принятия управленческих решений за счет оперативности представления, полноты, достоверности и удобства форматов отображения информации\n",
              "name": "Цели создания системы"
            }
          ]
        },
        {
          "name": "Характеристика объектов автоматизации",
          "children": [
            {
              "text": "",
              "name": "Краткие сведения об объекте автоматизации или ссылки на документы, содержащие такую информацию"
            },
            {
              "text": "Объектом автоматизации является процесс учета расчетов с работниками по оплате труда в организации, имеющей специфические принципы формирования расчетных сумм, в части расчета этих сумм и сбора данных из документов оперативного учета для проведения расчета.\n",
              "name": "Сведения об условиях эксплуатации объекта автоматизации и характеристиках окружающей среды"
            }
          ]
        },
        {
          "name": "Требования к системе",
          "children": [
            {
              "name": "Требования к системе в целом",
              "children": [
                {
                  "text": "Назначение и цели создания системы должны быть реализованы в двух подсистемах конфигурации «Бухгалтерия предприятия» на платформе «1С: Предприятие8.1»:\nСистема бухгалтерского учета\nСистема оперативного учета\nПодсистема оперативного учета должна содержать механизмы, позволяющие вводить в систему и хранить в ней информацию о текущей деятельности организации. В этой подсистеме должны фиксироваться и систематизироваться данные, необходимые для реализации расчета сумм начислений.\nПодсистема бухгалтерского учета должна содержать в себе механизмы для реализации учета расчетов с сотрудниками организации. Именно эта подсистема должна реализовывать процесс расчета, используя данные, содержащиеся в подсистеме оперативного учета.",
                  "name": "Требования к структуре и функционированию системы"
                },
                {
                  "text": "",
                  "name": "Требования к численности и квалификации персонала системы и режиму его работы"
                },
                {
                  "text": "Система должна предусматривать возможность масштабирования по производительности и объему обрабатываемой информации без модификации ее программного обеспечения путем модернизации используемого комплекса технических средств. Изменение процессов управления не должно отражаться на правильности функционирования системы.",
                  "name": "Показатели назначения"
                },
                {
                  "text": "",
                  "name": "Требования к надежности"
                },
                {
                  "text": "",
                  "name": "Требования безопасности"
                },
                {
                  "text": "",
                  "name": "Требования к эргономике и технической эстетике"
                },
                {
                  "text": "",
                  "name": "Требования к транспортабельности для подвижных АС"
                },
                {
                  "text": "",
                  "name": "Требования к эксплуатации, техническому обслуживанию, ремонту и хранению компонентов системы"
                },
                {
                  "text": "",
                  "name": "Требования к защите информации от несанкционированного доступа"
                },
                {
                  "text": "Система должна сохранять работоспособность и обеспечивать восстановление своих функций при возникновении следующих внештатных ситуаций:\nпри сбоях в системе электроснабжения аппаратной части, приводящих к перезагрузке ОС\nпри ошибках в работе аппаратных средств (кроме носителей данных и программ) восстановление функции системы возлагается на ОС\nпри ошибках, связанных с программным обеспечением (ОС и драйверы устройств), восстановление работоспособности возлагается на ОС\nсистема должна обеспечивать корректную обработку аварийных ситуаций, вызванных неверными действиями пользователей, неверным форматом или недопустимыми значениями входных данных. В указанных случаях система должна выдавать пользователю соответствующие сообщения, после чего возвращаться в рабочее состояние, предшествовавшее неверной (недопустимой) команде или некорректному вводу данных.\nСистема должна быть эргономичной. Интерфейс системы должен быть понятным и удобным, не должен быть перегружен графическими элементами и должен обеспечивать быстрое отображение экранных форм. Навигационные элементы должны быть выполнены в удобной для пользователя форме. Средства редактирования информации должны удовлетворять принятым соглашениям в части использования функциональных клавиш, режимов работы, поиска, использования оконной системы. Ввод-вывод данных системы, прием управляющих команд и отображение результатов их исполнения должны выполняться в интерактивном режиме. Интерфейс должен соответствовать современным эргономическим требованиям и обеспечивать удобный доступ к основным функциям и операциям системы.\nИнтерфейс должен быть рассчитан на преимущественное использование манипулятора типа «мышь», то есть управление системой должно осуществляться с помощью набора экранных меню, кнопок, значков и т. п. элементов. Клавиатурный режим ввода должен используется главным образом при заполнении и/или редактировании текстовых и числовых полей экранных форм.\nВсе надписи экранных форм, а также сообщения, выдаваемые пользователю (кроме системных сообщений) должны быть на русском языке.\nИС должна обеспечивать защиту от несанкционированного доступа. Компоненты подсистемы защиты от несанкционированного доступа должны обеспечивать:\nидентификацию пользователя\nпроверку полномочий пользователя при работе с системой\nразграничение доступа пользователей на уровне задач и информационных массивов.\n",
                  "name": "Требования по сохранности информации при авариях"
                },
                {
                  "text": "",
                  "name": "Требования к защите от влияния внешних воздействий"
                },
                {
                  "text": "",
                  "name": "Требования к патентной чистоте"
                },
                {
                  "text": "",
                  "name": "Требования по стандартизации и унификации"
                },
                {
                  "text": "",
                  "name": "Дополнительные требования"
                },
                {
                  "text": "Подсистема оперативного учета должна осуществлять ввод и хранение оперативных данных системы, данных для формирования аналитических отчетов, документов системы, сформированных в процессе работы.\nВсе элементы, входящие в состав подсистемы оперативного учета, должны обладать следующей основной функциональностью:\nПостоянное хранение данных\nДобавление новых элементов\nРедактирование элементов\nУдаление (удаление элементов возможно лишь в том случае, если другие существующие объекты системы не ссылаются на удаляемый элемент\nПросмотр элементов\nПросмотр списка элементов\nФильтрация и сортировка списка элементов\nПоиск элементов\nЭкспорт и импорт элементов.",
                  "name": "Подсистема оперативного учета"
                },
                {
                  "text": "Подсистема бухгалтерского учета должна иметь средства для регистрации бухгалтерских операций и формирования на их основе соответствующей итоговой информации, а также подготовки произвольных бухгалтерских отчетов. Подсистема бухгалтерского учета должна вести учет, ориентированный на первичные документы, относящиеся к подсистеме оперативного учета, и иметь функцию расчета сумм начислений заработной платы сотрудникам на основе этих документов.\n",
                  "name": "Подсистема бухгалтерского учета"
                },
                {
                  "text": "операционная систему: MS Windows 98/XP/Vista/Server 2003/2008\nпроцессор Intel Pentium II 400 МГц и выше (рекомендуется Intel Pentium III 866 МГц\nоперативная память 128 Мбайт и выше (рекомендуется 256 Мбайт\nжесткий диск (при установке используется около 120 Мбайт).",
                  "name": "Компьютер конечного пользователя"
                },
                {
                  "text": "операционная система: MS Windows 2000/XP/Vista/Server 2003/2008\nпроцессор Intel Pentium III 866 МГц и выше (рекомендуется Intel Pentium IV/Celeron 1800 МГц\nоперативная память 256 Мбайт и выше (рекомендуется 512 Мбайт\nжесткий диск (при установке используется около 120 Мбайт).",
                  "name": "Компьютер, используемый для разработки конфигураций"
                },
                {
                  "text": "операционная система: MS Windows 2000/XP/Vista/Server 2003/2008\nпроцессор Intel Pentium III 866 МГц и выше (рекомендуется Intel Pentium IV/Xeon 2,4 ГГц, для лучшей масштабируемости рекомендуется два и более процессоров\nоперативная память 512 Мбайт и выше (рекомендуется 1024 Мбайт).",
                  "name": "Компьютер сервера 1С:Предприятия 8.1"
                },
                {
                  "text": "Microsoft SQL Server 2000 + Service Pack 2 (рекомендуется Service Pack 3a) или Microsoft SQL Server 2005.",
                  "name": "Сервер баз данных"
                },
                {
                  "text": "операционная система: в соответствии с требованиями Microsoft SQL Server\nтехнические характеристики компьютера должны соответствовать требованиям используемой версии сервера баз данных MS SQL Server.\nд) метрологическому: требования не предъявляются\nе) организационному: для эффективного функционирования системы помимо пользователя необходим специалист по технической поддержке. К работе с системой должны допускаться сотрудники, имеющие навыки работы на персональном компьютере, ознакомленные с правилами эксплуатации и прошедшие обучение работе с системой.\nж) методическому: в состав методического обеспечения системы должны входить: инструкция программисту, инструкция пользователю.\n",
                  "name": "Компьютер сервера баз данных"
                }
              ]
            },
            {
              "text": "",
              "name": "Требования к функциям (задачам), выполняемым системой"
            },
            {
              "text": "К видам обеспечения предъявляются следующие требования:\nа) математическому: не предъявляются\nб) информационному: уровень хранения данных в системе должен быть построен на основе современных СУБД. Для обеспечения целостности данных должны использоваться встроенные механизмы СУБД. Доступ к данным должен быть предоставлен только авторизованным пользователям с учетом их служебных полномочий, а также с учетом категории запрашиваемой информации. Технические средства, обеспечивающие хранение информации, должны использовать современные технологии, позволяющие обеспечить повышенную надежность хранения данных и оперативную замену оборудования.\nв) лингвистическому: система создана на основе языка программирования «1С 8.1»\nг) программному и техническому:",
              "name": "Требования к видам обеспечения"
            },
            {
              "text": "Для наиболее эффективного функционирования системы помимо пользователя – главного бухгалтера организации, для автоматизации деятельности которого предназначена система, необходимо иметь специалиста технической поддержки данного программного продукта.",
              "name": "Требования к персоналу"
            }
          ]
        },
        {
          "text": "Перечень стадий и этапов работ, а так же сроки их исполнения представлены в Таблице 2.\nТаблица 2.\nЭтапы и сроки исполнения работ\n№\nВыполняемая работа\nСроки\n1.\nПостановка задачи\nМарт .\n2.\nПроектирование\nАпрель .\n3.\nКодирование\nМай .\n4.\nТестирование и отладка\nМай\n5.\nАнализ результатов\nИюнь .\nРаботы по созданию системы проводились физическим лицом – студенткой группы ИСЭд-51 УлГТУ, Башаровой И.С. Консультантом при разработке являлась Суркова Е.В., доцент кафедры «Информационные системы» УлГТУ, руководитель дипломного проекта.\n",
          "name": "Состав и содержание работ по созданию системы"
        },
        {
          "text": "Приемочные испытания должны включать проверку:\nполноты и качества реализации необходимых функций\nвыполнения каждого требования, относящегося к эргономике\nработы пользователей в диалоговом режиме\nсредств и методов восстановления работоспособности системы после отказов\nполноты действий, доступных пользователю, и их достаточность для функционирования системы\nреакции системы на ошибки пользователя\nтестирование на скорость реакции системы на команды пользователя.\n",
          "name": "Порядок контроля и приемки системы"
        },
        {
          "text": "Для подготовки объекта автоматизации к вводу системы в действие необходимо при помощи специалиста технической поддержки, осуществляющего обслуживание используемой в организации базовой конфигурации «Бухгалтерия предприятия», выгрузить все информацию, содержащуюся в этой конфигурации, для дальнейшего ее использования в разработанной системе. Загрузка информации в новую конфигурацию должна так же осуществляться специалистом технической поддержки.\nПеред началом использования системы пользователю необходимо ознакомится с руководством пользователя, содержащимся в сопроводительной документации разработанной системы и пройти обучение для ознакомления с принципами ее функционирования в течение 1 академического часа (при условии владения пользователя навыками работы в базовой конфигурации «Бухгалтерия предприятия» платформы «1С: Предприятие 8.1»).\n",
          "name": "Требования к составу и содержанию работ по подготовке объекта автоматизации к вводу системы в действие"
        },
        {
          "text": "",
          "name": "Требования к документированию"
        },
        {
          "text": "",
          "name": "Источники разработки"
        }
      ]
    }
  ]
}